#!/usr/bin/env python
# -*- coding: utf-8 -*-
from pprint import pprint

# Есть словарь магазинов с распродажами

shops = {
    'ашан':
        [
            {'name': 'печенье', 'price': 10.99},
            {'name': 'конфеты', 'price': 34.99},
            {'name': 'карамель', 'price': 45.99},
            {'name': 'пирожное', 'price': 67.99}
        ],
    'пятерочка':
        [
            {'name': 'печенье', 'price': 9.99},
            {'name': 'конфеты', 'price': 32.99},
            {'name': 'карамель', 'price': 46.99},
            {'name': 'пирожное', 'price': 59.99}
        ],
    'магнит':
        [
            {'name': 'печенье', 'price': 11.99},
            {'name': 'конфеты', 'price': 30.99},
            {'name': 'карамель', 'price': 41.99},
            {'name': 'пирожное', 'price': 62.99}
        ],
}

# Создайте словарь цен на продкты следующего вида (писать прямо в коде)
sweets = {
    'конфеты': [
        {'ашан': 'конфеты', 'price': 34.99},
        {'пятерочка': 'конфеты', 'price': 32.99},
        {'магнит': 'конфеты', 'price': 30.99},

    ],
    'печенье': [
        {'ашан': 'печенье', 'price': 10.99},
        {'пятерочка': 'печенье', 'price': 9.99},
        {'магнит': 'печенье', 'price': 11.99},
    ],
    'карамель':[
        {'ашан': 'карамель', 'price': 45.99},
        {'пятерочка': 'карамель', 'price': 46.99},
        {'магнит': 'карамель', 'price':41.99},
    ],
    'пирожное':[
        {'ашан': 'пирожное', 'price': 67.99},
        {'пятерочка': 'пирожное', 'price': 59.99},
        {'магнит': 'пирожное', 'price': 62.99},
    ],

}

pprint(sweets)
